{
    "categories": {
        "0": "technical",
        "1": "productivity",
        "2": "data (things)",
        "3": "analytics",
        "4": "web scraping"
    },
    "demo_page": "https://littlelambdas.com/backend",
    "description": "A collection of utilities to handle common back-end workflow data and file manipulation operations.",
    "image": "//s3.amazonaws.com/appforest_uf/f1620674100039x928417655764320000/Greek_lc_lamda.png",
    "license": "open_source",
    "link": "https://nodejs.org/api/buffer.html",
    "name": "Bubble Back End Utilities",
    "plugin_instructions": "This plugin provides the following Server Side Actions:\n\n\"Read to Base 64\" read the byte contents of any URL into a base 64 encode string. Returns a string of the base 64 encoded bytes. This is the equivalent of Bubble's :encoded in base64 operator but for any URL.\n\n\"Write from Base 64\" save any base 64 encode bytes to Bubble's Amazon S3. Returns the created file.\n\n\"UTF8 to Base 64\" encode any UTF8 string to a base 64. Returns a string containing the base 64 encoded string.\n\n\"UTF8 from Base 64\" decode a UTF8 string from base 64. Returns the decoded UTF8 string.\n\n\"Bytes to Base 64\" encode a list of numbers in base 64. Returns the base 64 encoded string.\n\n\"Bytes from Base 64\" decode a base 64 string into a list of number. Returns the numerical representation of the bytes as a list of numbers between 0 and 255.\n\n\"Bytes to UTF8\" encode a list of numbers in UTF8. Returns the UTF8 encoded string.\n\n\"Bytes from UTF8\" decode a UTF8 string into a list of number. Returns the numerical representation of the bytes as a list of numbers between 0 and 255.\n\n\"JSON Path Filter\" filter serialized JSON using a JSON path query string. Returns the serialized extracted JSON. See https://github.com/dchester/jsonpath for more details.\n\n\"Sample Dictionary\" crytographically strong random sampling with replacement from the text, which acts as the dictionary of characters or symbols.\n\n\"Group Text\" split the text into blocks of the specified size. Length of last box will be the remainder after division by size.\n\n\"Random Integer\" cryptographically strong random integer sampling with replacement from the range.\n\n\"Format JSON\" pretty print with indents any JSON string.\n\n\"Enumerate List\" returns a list of numbers from one to the limit.\n\n\"Generate UUID\" returns a random UUID using the native Node cryptography library.\n\n\"RegEx Match All\" returns a list of sub-string matches of the regular expression.\n\n\"Pad Number\" convert a number to string padding with leading zeros.",
    "sa_node_version": 18
}